<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.almenscorner.download.BetterMouse</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BetterMouse</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://better-mouse.com/</string>
                <key>re_pattern</key>
                <string>https://better-mouse.com/wp-content/uploads/BetterMouse.\S.*?.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/BetterMouse.app</string>
				<key>requirement</key>
				<string> anchor apple generic and identifier "com.naotanhaocan.BetterMouse" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "85C2C89SJH")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/BetterMouse.app</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%dmg_path%</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>
	</array>
</dict>
</plist>