<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Postman, builds a DMG and imports. Taken from bnpl-recipes repo

For Intel set DOWNLOAD_ARCH to "64" (default)

For Apple Silicon set DOWNLOAD_ARCH to "arm64"</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.Postman</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Postman</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>Create and send any HTTP request using the awesome Postman request builder. Write your own test cases to validate response data, response times, and more!</string>
		<key>developer</key>
		<string>Postdot Technologies, Inc.</string>
		<key>display_name</key>
		<string>Postman</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.2</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.postman</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%SUPPORTED_ARCH%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%dmg_path%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%dmg_path%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%dmg_path%</string>
				<key>bundleId</key>
				<string>%bundleid%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
