<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current version of PostgreSQL.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.PostgreSQL</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PostgreSQL</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
        <key>description</key>
            <string>PostgreSQL database system packaged by EnterpriseDB.com.

This installer includes the PostgreSQL server, pgAdmin; a graphical tool for managing and developing your databases, and StackBuilder; a package manager that can be used to download and install additional PostgreSQL tools and drivers. Stackbuilder includes management, integration, migration, replication, geospatial, connectors and other tools. </string>
        <key>developer</key>
		<string>EnterpriseDB Corporation</string>
		<key>display_name</key>
		<string>PostgreSQL</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
    <string>com.github.wholtz.pkg.PostgreSQL</string>
    <key>Process</key>
	<array>
	    <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/postgresql-%match%-1-osx.app/Contents/Info.plist</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>com.enterprisedb.postgresql.pkg</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string></string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
