<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the version of PostgreSQL sepcified in VERSION.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.download.PostgreSQLVersionSpecific</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PostgreSQL</string>
		<key>VERSION</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>table-body"&gt;(%VERSION%.*?)&lt;/td&gt;</string>
				<key>url</key>
				<string>https://www.enterprisedb.com/downloads/postgres-postgresql-downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://get.enterprisedb.com/postgresql/postgresql-%match%-1-osx.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/postgresql-%match%-1-osx.app</string>
				<key>requirement</key>
				<string>identifier "com.edb.postgresql" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "26QKX55P9K"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
