<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Azul Zulu OpenJDK 11 LTS.
Set the ARCHITECTURE key to "x" to download the Intel version or "aarch" for Apple Silicon version.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.Azul Zulu OpenJDK 11 LTS</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>aarch</string>
		<key>NAME</key>
		<string>AzulZuluOpenJDK11LTS</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>Azul Zulu builds of OpenJDK are open source, TCK-tested and certified builds of OpenJDK. Azul Zulu is available for a wide range of hardware platforms and operating systems.</string>
		<key>developer</key>
		<string>Azul Systems</string>
		<key>display_name</key>
		<string>Azul Zulu OpenJDK 11 LTS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.pkg.Azul Zulu OpenJDK 11 LTS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%destination_path%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%destination_path%</string>
				<key>pkg_payload_path</key>
				<string>%destination_path%/%found_basename%/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%destination_path%/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleID</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack/</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>%bundleID%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string></string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
