<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Grammarly disk image.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.Grammarly</string>
	<key>Input</key>
	<dict>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>App and web service for correcting grammatical issues and detecting plagarism.</string>
		<key>developer</key>
		<string>Grammarly, Inc</string>
		<key>display_name</key>
		<string>Grammarly</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.Grammarly</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Grammarly Desktop.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/Grammarly Installer.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Grammarly Desktop.app/Contents/Info.plist</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleShortVersionString</key>
					<string>version</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pathname%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>bundleId</key>
				<string>%bundleid%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
