<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OpenJDK. Set ARCHITECTURE "x64" to download the Intel or "aarch64" for Apple Silicon.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.OpenJDK</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>aarch64</string>
		<key>NAME</key>
		<string>OpenJDK</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>OpenJDK is a free and open-source implementation of the Java Platform, Standard Edition.</string>
		<key>developer</key>
		<string>Oracle</string>
		<key>display_name</key>
		<string>OpenJDK</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.pkg.OpenJDK</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>net.java.openjdk</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string></string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
