<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.almenscorner.download.Jumpshare</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Jumpshare</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://jumpshare.com/downloading?os=mac#</string>
                <key>re_pattern</key>
                <string>https:\/\/[a-zA-Z0-9.-]+\.cloudfront\.net\/desktop\/mac\/Jumpshare\.dmg</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4324.96 Safari/537.36</string>
                </dict>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%match%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Jumpshare.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.jumpshare.Jumpshare" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "697K87ALT7")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>