<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of ArchiChect for macOS.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.ArchiChect</string>
	<key>Input</key>
	<dict>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
        <string>Drag and drop, or Open, almost any app, bundle, command tool, Installer package, even signed AppleScripts and regular documents, and ArchiChect will tell you whether its quarantine flag is set, if it contains executable code whether that is fully 64-bit, whether it has a valid signature, and whether it has been notarized, delivered by the App Store, or signed by Apple. The ultimate tool for checking Catalina compatibility, and much more.</string>
        <key>developer</key>
        <string>The Eclectic Company</string>
		<key>display_name</key>
		<string>ArchiChect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jpiel.download.ArchiChect</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%dmg_path%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%dmg_path%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%dmg_path%</string>
				<key>bundleId</key>
				<string>%bundleid%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>postinstall_script</key>
				<string></string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
