<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of ClickShare for macOS.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.ClickShare</string>
	<key>Input</key>
	<dict>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>ClickShare, wireless presentation and conferencing technology, creates understanding between people by freeing them to interact easily and naturally.</string>
		<key>developer</key>
		<string>Barco</string>
		<key>display_name</key>
		<string>ClickShare</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.moofit-recipes.pkg.ClickShare</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkgroot%/payload/Applications/%NAME%.app</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>%bundleid%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
