<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Basecamp 3 Mac app.

    By default the arm version is downloaded. To download the x86 version, set ARCH to an empty value
    </string>
	<key>Identifier</key>
	<string>com.github.autopkg.almenscorner.download.Basecamp3</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>_arm64</string>
		<key>DOWNLOAD_URL</key>
		<string>https://bc3-desktop.s3.amazonaws.com/mac%ARCH%/basecamp3%ARCH%.dmg</string>
		<key>NAME</key>
		<string>Basecamp3</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Basecamp.app</string>
				<key>requirement</key>
				<string>identifier "com.basecamp.basecamp3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2WNYUYRS7G"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
