<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of JetBrains Fleet.
    
    Supported values for ARCH include:
    - aarch64 (Default, Apple Silicon)
    - x64 (Intel)
    </string>
	<key>Identifier</key>
	<string>com.github.almenscorner.download.Fleet</string>
	<key>Input</key>
	<dict>
        <key>ARCH</key>
        <string>aarch64</string>
		<key>NAME</key>
		<string>Fleet</string>
		<key>SEARCH_URL</key>
        <string>https://data.services.jetbrains.com/products</string>
        <key>SEARCH_PATTERN</key>
        <string>macos_%ARCH%.*?"(https://download.jetbrains.com/fleet/installers/macos_%ARCH%/Fleet-[^"]+\.dmg)"</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
 		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Fleet.app</string>
				<key>requirement</key>
				<string>identifier "com.jetbrains.fleet" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>