<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest stable version of SmartGit for macOS.

To Download for Intel, set ARCH to x86_64
</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.download.SmartGit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SmartGit</string>
        <key>ARCH</key>
        <string>aarch64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_flags</key>
				<array>
					<string>MULTILINE</string>
				</array>
				<key>re_pattern</key>
				<string>https://downloads.syntevo.com/downloads/smartgit/smartgit-%ARCH%-[a-zA-Z0-9.-_]+.dmg</string>
				<key>url</key>
				<string>https://www.syntevo.com/smartgit/download/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.syntevo.smartgit" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = PHMY45PTNW</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
