<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of TeamViewer for macOS.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.TeamViewer</string>
	<key>Input</key>
	<dict>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>All-In-One Solution for Remote Access and Support over the Internet.</string>
		<key>developer</key>
		<string>TeamViweer GmbH</string>
		<key>display_name</key>
		<string>TeamViewer</string>
		<key>postinstallscript</key>
		<string>IyEvYmluL3NoCiMjIHBvc3RpbnN0YWxsIHNjcmlwdAoKIyBDbGVhbiB0aGUgdG1wIGZpbGUgY3JlYXRlZCBhdCBwcmVpbnN0YWxsIHBoYXNlLgoKc3VkbyBybSAtcmYgL3RtcC90dm9ubHlzdGFydHNlcnZpY2U=</string>
		<key>preinstallscript</key>
		<string>IyEvYmluL3NoCiMjIHByZWluc3RhbGwgc2NyaXB0CgojIFNldCBUZWFtVmlld2VyIHRvIG9ubHkgcmVzdGFydCB0aGUgc2VydmljZQojIGFmdGVyIGluc3RhbGxhdGlvbiwgYWNoaWV2ZWQgYnkgY3JlYXRpbmcgdGhlCiMgZm9sbG93aW5nIGZpbGUKCmVjaG8gIjEiID4gL3RtcC90dm9ubHlzdGFydHNlcnZpY2U=</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.TeamViewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/TeamViewerApp.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%RECIPE_CACHE_DIR%/payload/TeamViewer.app</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/TeamViewer.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleID</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PlistReader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>%bundleID%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>postinstall_script</key>
				<string>%postinstallscript%</string>
				<key>preinstall_script</key>
				<string>%preinstallscript%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
