<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of KeePassXC for macOS.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.KeePassXC</string>
	<key>Input</key>
	<dict>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>KeePassXC is a community fork of KeePassX with the goal to extend and improve it with new features and bugfixes to provide a feature-rich, fully cross-platform and modern open-source password manager.</string>
		<key>developer</key>
		<string>KeePassXC</string>
		<key>display_name</key>
		<string>KeePassXC</string>
		<key>postinstallscript</key>
		<string>IyEvYmluL2Jhc2gKCiMgQ2hlY2sgaWYgdGhlIHN5c3RlbSBpcyBydW5uaW5nIG9uIEFwcGxlIFNpbGljb24KaWYgW1sgJCh1bmFtZSAtbSkgPT0gJ2FybTY0JyBdXTsgdGhlbgogICAgZWNobyAiQXBwbGUgU2lsaWNvbiBkZXRlY3RlZC4iCgogICAgIyBDaGVjayBpZiBSb3NldHRhIGlzIGluc3RhbGxlZAogICAgaWYgISAvdXNyL2Jpbi9wZ3JlcCBvYWhkID4vZGV2L251bGwgMj4mMTsgdGhlbgogICAgICAgIGVjaG8gIlJvc2V0dGEgMiBpcyBub3QgaW5zdGFsbGVkLiBJbnN0YWxsaW5nIFJvc2V0dGEgMi4uLiIKICAgICAgICAKICAgICAgICAjIFByb21wdCB0byBpbnN0YWxsIFJvc2V0dGEgMgogICAgICAgIC91c3Ivc2Jpbi9zb2Z0d2FyZXVwZGF0ZSAtLWluc3RhbGwtcm9zZXR0YSAtLWFncmVlLXRvLWxpY2Vuc2UKCiAgICAgICAgaWYgWyAkPyAtZXEgMCBdOyB0aGVuCiAgICAgICAgICAgIGVjaG8gIlJvc2V0dGEgMiBpbnN0YWxsZWQgc3VjY2Vzc2Z1bGx5LiIKICAgICAgICBlbHNlCiAgICAgICAgICAgIGVjaG8gIkZhaWxlZCB0byBpbnN0YWxsIFJvc2V0dGEgMi4gUGxlYXNlIHRyeSBhZ2Fpbi4iCiAgICAgICAgZmkKICAgIGVsc2UKICAgICAgICBlY2hvICJSb3NldHRhIDIgaXMgYWxyZWFkeSBpbnN0YWxsZWQuIgogICAgZmkKZmk=</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.KeePassXC</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pathname%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/KeePassXC.app</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/KeePassXC.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>%bundleid%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>postinstall_script</key>
				<string>%postinstallscript%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
