<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tunnelblick.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.Tunnelblick</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Tunnelblick</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>Tunnelblick is a Mac app that lets you easily connect to OpenVPN.</string>
		<key>developer</key>
		<string>The Tunnelblick Project</string>
		<key>display_name</key>
		<string>Tunnelblick</string>
		<key>postinstall</key>
		<string>IyEvYmluL3NoCiMgYmFzZWQgb24gZm9ydW0gZGlzY3Vzc2lvbjoKIyBodHRwczovL2dyb3Vwcy5nb29nbGUuY29tL2ZvcnVtLyMhdG9waWMvdHVubmVsYmxpY2stZGlzY3Vzcy9VWWVSN3Z2X3JYTQoKIyBzZXR1cCBmb2xkZXJzIGFuZCBzZWN1cmUgVHVubmVsYmxpY2sgYXBwCi9BcHBsaWNhdGlvbnMvVHVubmVsYmxpY2suYXBwL0NvbnRlbnRzL1Jlc291cmNlcy9pbnN0YWxsZXIgNQoKIyBzZWN1cmUgY29uZmlndXJhdGlvbnMKL0FwcGxpY2F0aW9ucy9UdW5uZWxibGljay5hcHAvQ29udGVudHMvUmVzb3VyY2VzL2luc3RhbGxlciAxNg==</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.Tunnelblick</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pathname%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>%BUNDLE_ID%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>postinstall_script</key>
				<string>%postinstall%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
