<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Node JS LTS.

    MAJOR_VERSION needs to be one of the 'latest-v' version numbers listed here: https://nodejs.org/dist/
    </string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.NodeJSLTS</string>
	<key>Input</key>
	<dict>
        <key>MAJOR_VERSION</key>
        <string>23</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
        <string>NodeLTS.js® is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications.</string>
        <key>developer</key>
        <string>Node.js Foundation</string>
		<key>display_name</key>
		<string>Node.js LTS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.nodejslts</string>
	<key>Process</key>
	<array>
    	<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%destination_path%/Resources/osx_installer_logo.png</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/nodejslts.png</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pathname%</string>
				<key>bundleId</key>
				<string>org.nodejs.node.pkg</string>
				<key>bundleVersion</key>
				<string>%MAJOR_VERSION%.%MINOR_VERSION%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%destination_path%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%MAJOR_VERSION%.%MINOR_VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
