<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ReiKey.</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.ReiKey</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ReiKey</string>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
        <string>ReiKey provides continual protection by monitoring persistence locations. Any new persistent component will trigger a ReiKey alert, allowing malicious items be blocked.</string>
        <key>developer</key>
        <string>Objective-See</string>
		<key>display_name</key>
		<string>ReiKey</string>
        <key>post_install_script</key>
        <string>IyEvYmluL3NoCnN1ZG8gIi9BcHBsaWNhdGlvbnMvUmVpS2V5IEluc3RhbGxlci5hcHAvQ29udGVudHMvTWFjT1MvUmVpS2V5IEluc3RhbGxlciIgLWluc3RhbGwKcm0gLXJmICIvQXBwbGljYXRpb25zL1JlaUtleSBJbnN0YWxsZXIuYXBwLyIKZXhpdCAw</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.ReiKey</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME% Installer.app</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME% Installer.app</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pkg_path%</string>
				<key>bundleId</key>
				<string>com.objective-see.ReiKey-Installer</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
                <key>postinstall_script</key>
                <string>%post_install_script%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
