<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tabby from GitHub.
Set PRERELEASE to a non-empty string to download prereleases, either
via Input in an override or via the -k option,
i.e.: `-k PRERELEASE=yes`

Supported values for ARCH include:
- x86_64 (Intel)
- arm64 (Default, Apple Silicon)
</string>
	<key>Identifier</key>
	<string>com.github.almenscorner.intune.Tabby</string>
	<key>Input</key>
	<dict>
		<key>categories</key>
		<array>
			<string>Productivity</string>
		</array>
		<key>description</key>
		<string>Tabby is an alternative to Windows' standard terminal (conhost), PowerShell ISE, PuTTY, macOS Terminal.app and iTerm.</string>
		<key>developer</key>
		<string>Eugeny</string>
		<key>display_name</key>
		<string>Tabby</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.almenscorner.download.Tabby</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pathname%</string>
				<key>name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_file</key>
				<string>%pathname%</string>
				<key>bundleId</key>
				<string>%bundleid%</string>
				<key>bundleVersion</key>
				<string>%version%</string>
				<key>description</key>
				<string>%description%</string>
				<key>displayname</key>
				<string>%display_name%</string>
				<key>icon</key>
				<string>%icon_file_path%</string>
				<key>publisher</key>
				<string>%developer%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
		</dict>
	</array>
</dict>
</plist>
